layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mean_value: 123
    mean_value: 116
    mean_value: 103
    scale: 0.017429
    resize_param {
      prob: 1
      resize_mode: WARP
      height: 160
      width: 80
      interp_mode: LINEAR
    }
  }
  image_data_param {
    source: "data/calib.txt"    #only used for calibration
    root_folder: 'data/market1501/bounding_box_test/'
    batch_size: 1
    new_height: 160
    new_width: 80
}
}

layer {
  name: "ConvNd_1"
  type: "Convolution"
  bottom: "data"
  top: "BatchNorm_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 3
    kernel_size: 7
    group: 1
    stride: 2
    dilation: 1
  }
}
layer {
  name: "Threshold_1"
  type: "ReLU"
  bottom: "BatchNorm_1"
  top: "BatchNorm_1"
}
layer {
  name: "MaxPool2d_1"
  type: "Pooling"
  bottom: "BatchNorm_1"
  top: "MaxPool2d_1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "ConvNd_2"
  type: "Convolution"
  bottom: "MaxPool2d_1"
  top: "BatchNorm_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Threshold_2"
  type: "ReLU"
  bottom: "BatchNorm_2"
  top: "BatchNorm_2"
}
layer {
  name: "ConvNd_3"
  type: "Convolution"
  bottom: "BatchNorm_2"
  top: "BatchNorm_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_1"
  type: "Eltwise"
  bottom: "BatchNorm_3"
  bottom: "MaxPool2d_1"
  top: "Add_1"
}
layer {
  name: "Threshold_3"
  type: "ReLU"
  bottom: "Add_1"
  top: "Add_1"
}
layer {
  name: "ConvNd_4"
  type: "Convolution"
  bottom: "Add_1"
  top: "BatchNorm_4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Threshold_4"
  type: "ReLU"
  bottom: "BatchNorm_4"
  top: "BatchNorm_4"
}
layer {
  name: "ConvNd_5"
  type: "Convolution"
  bottom: "BatchNorm_4"
  top: "BatchNorm_5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_2"
  type: "Eltwise"
  bottom: "BatchNorm_5"
  bottom: "Add_1"
  top: "Add_2"
}
layer {
  name: "Threshold_5"
  type: "ReLU"
  bottom: "Add_2"
  top: "Add_2"
}
layer {
  name: "ConvNd_6"
  type: "Convolution"
  bottom: "Add_2"
  top: "BatchNorm_6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    dilation: 1
  }
}
layer {
  name: "Threshold_6"
  type: "ReLU"
  bottom: "BatchNorm_6"
  top: "BatchNorm_6"
}
layer {
  name: "ConvNd_7"
  type: "Convolution"
  bottom: "BatchNorm_6"
  top: "BatchNorm_7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "ConvNd_8"
  type: "Convolution"
  bottom: "Add_2"
  top: "BatchNorm_8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 2
    dilation: 1
  }
}
layer {
  name: "Add_3"
  type: "Eltwise"
  bottom: "BatchNorm_7"
  bottom: "BatchNorm_8"
  top: "Add_3"
}
layer {
  name: "Threshold_7"
  type: "ReLU"
  bottom: "Add_3"
  top: "Add_3"
}
layer {
  name: "ConvNd_9"
  type: "Convolution"
  bottom: "Add_3"
  top: "BatchNorm_9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Threshold_8"
  type: "ReLU"
  bottom: "BatchNorm_9"
  top: "BatchNorm_9"
}
layer {
  name: "ConvNd_10"
  type: "Convolution"
  bottom: "BatchNorm_9"
  top: "BatchNorm_10"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_4"
  type: "Eltwise"
  bottom: "BatchNorm_10"
  bottom: "Add_3"
  top: "Add_4"
}
layer {
  name: "Threshold_9"
  type: "ReLU"
  bottom: "Add_4"
  top: "Add_4"
}
layer {
  name: "ConvNd_11"
  type: "Convolution"
  bottom: "Add_4"
  top: "BatchNorm_11"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    dilation: 1
  }
}
layer {
  name: "Threshold_10"
  type: "ReLU"
  bottom: "BatchNorm_11"
  top: "BatchNorm_11"
}
layer {
  name: "ConvNd_12"
  type: "Convolution"
  bottom: "BatchNorm_11"
  top: "BatchNorm_12"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "ConvNd_13"
  type: "Convolution"
  bottom: "Add_4"
  top: "BatchNorm_13"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 2
    dilation: 1
  }
}
layer {
  name: "Add_5"
  type: "Eltwise"
  bottom: "BatchNorm_12"
  bottom: "BatchNorm_13"
  top: "Add_5"
}
layer {
  name: "Threshold_11"
  type: "ReLU"
  bottom: "Add_5"
  top: "Add_5"
}
layer {
  name: "ConvNd_14"
  type: "Convolution"
  bottom: "Add_5"
  top: "BatchNorm_14"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Threshold_12"
  type: "ReLU"
  bottom: "BatchNorm_14"
  top: "BatchNorm_14"
}
layer {
  name: "ConvNd_15"
  type: "Convolution"
  bottom: "BatchNorm_14"
  top: "BatchNorm_15"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_6"
  type: "Eltwise"
  bottom: "BatchNorm_15"
  bottom: "Add_5"
  top: "Add_6"
}
layer {
  name: "Threshold_13"
  type: "ReLU"
  bottom: "Add_6"
  top: "Add_6"
}
layer {
  name: "ConvNd_16"
  type: "Convolution"
  bottom: "Add_6"
  top: "BatchNorm_16"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    dilation: 1
  }
}
layer {
  name: "Threshold_14"
  type: "ReLU"
  bottom: "BatchNorm_16"
  top: "BatchNorm_16"
}
layer {
  name: "ConvNd_17"
  type: "Convolution"
  bottom: "BatchNorm_16"
  top: "BatchNorm_17"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "ConvNd_18"
  type: "Convolution"
  bottom: "Add_6"
  top: "BatchNorm_18"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 2
    dilation: 1
  }
}
layer {
  name: "Add_7"
  type: "Eltwise"
  bottom: "BatchNorm_17"
  bottom: "BatchNorm_18"
  top: "Add_7"
}
layer {
  name: "Threshold_15"
  type: "ReLU"
  bottom: "Add_7"
  top: "Add_7"
}
layer {
  name: "ConvNd_19"
  type: "Convolution"
  bottom: "Add_7"
  top: "BatchNorm_19"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Threshold_16"
  type: "ReLU"
  bottom: "BatchNorm_19"
  top: "BatchNorm_19"
}
layer {
  name: "ConvNd_20"
  type: "Convolution"
  bottom: "BatchNorm_19"
  top: "BatchNorm_20"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_8"
  type: "Eltwise"
  bottom: "BatchNorm_20"
  bottom: "Add_7"
  top: "Add_8"
}
layer {
  name: "Threshold_17"
  type: "ReLU"
  bottom: "Add_8"
  top: "Add_8"
}
layer {
  name: "AvgPool2d_1"
  type: "Pooling"
  bottom: "Add_8"
  top: "AvgPool2d_1"
  pooling_param {
    pool: AVE
    pad: 0
    kernel_h: 5
    kernel_w: 3
    stride_h: 5
    stride_w: 3
  }
}
layer {
  name: "View_1"
  type: "Flatten"
  bottom: "AvgPool2d_1"
  top: "View_1"
  phase: TEST
}
